/*
 
 *********************************************************************************
 *
 * 在使用 BAKit 的过程中如果出现 bug 请及时以以下任意一种方式联系我，我会及时修复 bug
 *
 * QQ     : 可以添加ios开发技术群 479663605 在这里找到我(博爱1616【137361770】)
 * 微博    : 博爱1616
 * Email  : 137361770@qq.com
 * GitHub : https://github.com/boai
 * BAHome : https://github.com/BAHome
 * 博客    : http://boaihome.com
 
 *********************************************************************************
 
 */

#ifndef BAWKWebView_WebP_h
#define BAWKWebView_WebP_h

#import "NSURLProtocol+BAWebView.h"

/*!
 *********************************************************************************
 ************************************ 更新说明 ************************************
 *********************************************************************************
 
 欢迎使用 BAHome 系列开源代码 ！
 如有更多需求，请前往：https://github.com/BAHome
 
 项目源码地址：
 OC 版 ：https://github.com/BAHome/BAWKWebView_WebP
 
 最新更新时间：2020-09-28 【倒叙】<br>
 最新Version：【Version：1.0.3】<br>
 更新内容：<br>
 1.0.0.1、用分类封装 WKWebView，代码无任何侵入更改<br>
 1.0.0.2、WKWebView 目前可以兼容 GIF 动图显示，和 webp 的静态图片显示（webp 的动态图片显示需要等待后期版本更新）<br>
 1.0.3:     已支持webp动图显示<br>

 */

#endif /* BAWKWebView_WebP_h */
